---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSegmentLength
source: html/a6d10927-d9a1-1738-81b7-010baae830c9.htm
---
# RebarShapeConstraintSegmentLength Properties

Specifies whether the .NET object represents a valid Revit entity.